
"keyYes"							= "Kyllä";
"keyNo"								= "Ei";
"keyOK"								= "OK";
"keyRequired"						= "Vaaditaan";
"keyNone"							= "Ei mitään";

"keyPairedDevicesTitle"				= "Laiteparit:";
"keyFavoriteDevicesTitle"			= "Suosikkilaitteet:";
"keyConnectedDevicesTitle"			= "Laitteet, joihin ollaan yhteydessä:";
"keyUnknownDevice"					= "Tuntematon laite";
"keyErrorOccurred"					= "Tapahtui virhe. (0x%x)";
"keyNotAvailable"					= "Ei käytettävissä.";
"keyNameNotAvailable"				= "Nimi ei käytettävissä";
"keyNoDevicePresent"				= "Ei käytettäviä Bluetooth-laitteita.";

"keyPrefReadErrorTitle"				= "Bluetooth-asetuksia luettaessa tapahtui virhe.";
"keyPrefReadErrorDesc"				= "Tämän tietokoneen Bluetooth-määrittely on virheellinen. Asenna Bluetooth-ohjelmisto uudelleen.";

"keyUnacceptablePathTitle"			= "Valittu polku ei ole kelvollinen.";
"keyUnacceptablePathDesc"			= "Määritelty polku ei sovellu Bluetooth OBEX:in käyttöön. Tämä johtuu todennäköisesti siitä, että sinulla ei ole kirjoitusoikeuksia kohdehakemistoon. Määrittele toinen hakemisto.";

"keyPathWarningTitle"				= "Määriteltyä kansiota ei suositella.";
"keyPathWarningDesc"				= "Kansio saattaa olla lukittu, tai sinulle ei ole oikeuksia lukea tai kirjoittaa sitä.";

"keyPrefSaveErrorTitle"				= "Bluetooth-asetuksia kirjoitettaessa tapahtui virhe.";
"keyPrefSaveErrorDesc"				= "Joitakin Bluetooth-asetuksia ei voitu tallentaa. Bluetooth-laite ei todennäköisesti ole tietokoneen käytettävissä.";

"keyPortInUseTitle"					= "Portti on käytössä.";
"keyPortInUseDelete"				= "Yrität poistaa porttia, joka on käytössä. Lopeta porttia käyttävä ohjelma ja yritä uudelleen.";
"keyPortInUseEdit"					= "Yrität muokata porttia, joka on käytössä. Lopeta porttia käyttävä ohjelma ja yritä uudelleen.";

"kServiceCannotBeModifiedKey"		= "Palvelua ei voida muokata.";
"kPortCannotBeCreatedOrModifiedKey"	= "Porttia luotaessa tai muokattaessa tapahtui virhe.";

"keyTTYNameAlreadyInUse"			= "Nimi on jo käytössä";
"keyTTYNameInUseText"				= "Valittu porttinimi on jo käytössä. Valitse toinen nimi.";

"kTTYSerialPortKey"					= "Sarjaportti";	/* One word, no spaces, no special caracters, only ASCII from 'a' to 'z' and 'A' to 'Z' no extra alphabets, this becomes a TTY name !! */
"kBluetoothSerialPortKey"			= "Sarjaportti";
"kBluetoothSerialPortOnKey"			= "Bluetooth-sarjaportti päällä";
"kBluetoothSerialPortOffKey"		= "Bluetooth-sarjaportti pois päältä";
"kEditSerialPorts"					= "Muokkaa sarjaportteja…";
"kSerialPortKey"					= "Sarjaportti";
"kSerialPortOnKey"					= "Sarjaportti päällä";
"kSerialPortOffKey"					= "Sarjaportti pois päältä";
"kOtherKey"							= "Muu…";
"kBluetoothFileExchangeKey"			= "Tiedostojako";
"kBluetoothFileExchangeOnKey"		= "Bluetooth-tiedostojako päällä";
"kBluetoothFileExchangeOffKey"		= "Bluetooth-tiedostojako pois päältä";
"kBluetoothFileTransferKey"			= "Tiedostonsiirto";
"kBluetoothFileTransferOnKey"		= "Bluetooth-tiedostonsiirto päällä";
"kBluetoothFileTransferOffKey"		= "Bluetooth-tiedostonsiirto pois päältä";

"kBluetoothRemoteControlKey"		= "Kaukosäätö";
"kBluetoothRemoteControlOnKey"		= "Bluetooth-kaukosäätö päällä";
"kBluetoothRemoteControlOffKey"		= "Bluetooth-kaukosäätö pois";

"kBluetoothPANServiceKey"			= "Lähiverkko";
"kBluetoothPANServiceOnKey"			= "Bluetooth-lähiverkko päällä";
"kBluetoothPANServiceOffKey"		= "Bluetooth-lähiverkko pois";

"kDeviceNameTitle"					= "Bluetooth-laitteet käyttävät tietokoneeseen yhdistämiseen nimeä ”%@”.";

"kInKey"							= "Sisään";		/* Short for Incoming */
"kOutKey"							= "Ulos";	/* Short for Outgoing */

"kEllipsisString"						= "…";
"kPower"								= "Teho";
"kBluetoothPower"						= "Bluetooth-teho";
"kBluetoothPowerOn"						= "Bluetooth päällä";
"kBluetoothPowerOff"					= "Bluetooth POIS";
"kBluetoothPowerIsOff"					= "Bluetooth on pois päältä. Jos haluat käyttää Bluetoothia, laita se ensin päälle.";
"kTurnBTOff"							= "Sammuta Bluetooth";
"kTurnBTOn"								= "Kytke Bluetooth päälle";
"kVersionKey"							= "(Versio: %d.%d.%d%c%d)";
"kOnKey"								= "Päällä";
"kCancelKey"							= "Kumoa";
"kOffKey"								= "Pois";
"kNever"								= "Ei koskaan";

"kIsConnected"							= "Yhteydessä";
"kIsNotConnected"						= "Ei yhteydessä";

"kAddToFavoritesKey"					= "Lisää suosikkeihin";
"kRemoveFromFavoritesKey"				= "Poista suosikeista";

"kRenameDeviceKey"						= "Nimeä uudelleen";

"kBluetoothSetupDevice"					= "Asenna tämä laite…";
"kDisconnectDevice"						= "Katkaise yhteys";
"kResetDevice"							= "Palauta laitteen tehdasasetukset";
"kConnectDevice"						= "Yhdistä";
"kConfigureDevice"						= "Määrittele laite…";
"kMoreInfo"								= "Lisätietoja";
"kHideMoreInfo"							= "Kätke lisätiedot";
"kNoDevicesKey"							= "Ei laitteita";

"kDeviceNameKey"						= "Nimi";
"kDeviceAddressKey"						= "Osoite";
"kDeviceTypeKey"						= "Tyyppi";
"kDeviceServicesKey"					= "Palvelut";
"kOtherServices"						= "Muut palvelut";
"kUnknownService"						= "Tuntematon palvelu";

"kPairedHeaderKey"						= "Pari muodostettu";
"kConfiguredHeaderKey"					= "Määritelty";
"kFavoriteHeaderKey"					= "Suosikki";
"kConnectedHeaderKey"					= "Yhteydessä";
"kSerialPortsHeaderKey"					= "Sarjaportit";
"kSerialPortsHeaderDeviceService"		= "Laitepalvelu";
"kSerialPortsHeaderPortType"			= "Portin protokolla";
"kSerialPortDirectionIncoming"			= "Saapuva";
"kSerialPortDirectionOutgoing"			= "Lähtevä";

"kSerialPortHeadingOutgoing"			= "Muokkaa lähtevän sarjaportin asetuksia valitsemalla se";
"kSerialPortHeadingIncoming"			= "Muokkaa saapuvan sarjaportin asetuksia valitsemalla se";

"kHIDDeviceDeleteKeyboardPairingWarning"		= "Tämä on ainoa tietokoneeseen yhdistettynä näppäimistö. Jos poistat näppäimistön, et voi enää käyttää sitä. Haluatko varmasti poistaa sen?";
"kHIDDeviceDeleteMousePairingWarning"			= "Tämä on ainoa tietokoneeseen yhdistettynä oleva osoitinlaite. Jos poistat tämän hiiren luettelosta, et voi käyttää sitä. Haluatko varmasti poistaa sen?";
"kHIDDeviceDeleteTrackpadPairingWarning"		= "Tämä on ainoa tietokoneeseen yhdistettynä oleva osoitinlaite. Jos poistat tämän ohjauslevyn luettelosta, et voi käyttää sitä. Haluatko varmasti poistaa sen?";
"kHIDDeviceKeyboard"					= "näppäimistö";
"kHIDDeviceMouse"						= "hiiri";

"kDiscoverableTooltip"		= "Jos tämä on valittuna, tuntemattomat Bluetooth-laitteet eivät enää löydä tietokonetta. Laitteet, jotka ovat jo muodostaneet parin tietokoneen kanssa, voivat edelleen muodostaa yhteyden tietokoneeseen.";

"kOptionIsAvailable"		= "Käytettävissä";
"kAvailableServiceTurnOn"	= "Laita palvelu päälle";
"kAvailableServiceTurnOff"	= "Laita palvelu pois päältä";

"kOptionPairing"			= "Vaatii parinmuodostuksen";
"kPairingRequired"			= "Vaadi parinmuodostus";
"kPairingNotRequired"		= "Älä vaadi parinmuodostusta";

"kOptionReceiveBehavior"	= "Tiedostoja vastaanotettaessa:";
"kReceiveBehaviorAccept"	= "Hyväksy ilman varoitusta";
"kReceiveBehaviorPrompt"	= "Kysy jokaisesta tiedostosta";

"kOptionHandlePIMItem"		= "Kun PIM-kohteita vastaanotetaan:";
"kOptionHandleOtherItem"	= "Kun muita kohteita vastaanotetaan:";
"kHandleItemSave"			= "Tallenna";
"kHandleItemOpen"			= "Avaa";
"kHandleItemAsk"			= "Kysy";

"kOptionReceiveFolder"		= "Vastaanota kansio";
"kReceiveFolderChoose"		= "Muu…";

"kOptionFolderForBrowse"	= "Kansio, jota muut laitteet voivat selata";

"kOptionName"				= "Nimi:";
"kOptionShowInNetworkPrefs"	= "Näytä verkkoasetuksissa:";
"kOptionType"				= "Tyyppi:";
"kOptionTypeModem"			= "Modeemi";
"kOptionTypeRS232"			= "RS-232";


"kOptionEditSerialPortName"	= "Muokkaa portin nimeä…";
"kOptionAddSerialPort"		= "Lisää sarjaportti";
"kOptionRemoveSerialPort"	= "Poista sarjaportti";

"kButtonAddDevice"			= "Asenna uusi laite";
"kButtonRemoveDevice"		= "Poista valittu laite";
"kButtonDeviceOptions"		= "Suorita tehtävät valitulla laitteella";
"kBluetoothDevices"			= "Bluetooth-laitteet";

"kOptionMajorClass"			= "Laitteen pääluokka";
"kOptionMinorClass"			= "Laitteen aliluokka";
"kOptionServiceClass"		= "Laitteen palveluluokka";
"kOptionLastNameUpdate"		= "Viimeisin nimipäivitys";
"kOptionLastInquiryUpdate"	= "Viimeisin tiedustelupäivitys";
"kOptionLastServicesUpdate"	= "Viimeisin palvelupäivitys";
"kOptionProductID"			= "Tuotteen tunnus";
"kOptionVendorID"			= "Valmistajan tunnus";

"kPerformSDPQueryKey"				= "Päivitä laitteen palvelut";
"kPerformNameRequestKey"			= "Päivitä laitteen nimi";

"kOpenBTPrefsKey"					= "Avaa Bluetooth-asetukset…";
"kMousePreferences"					= "Avaa hiiriasetukset…";
"kKeyboardPreferences"				= "Avaa näppäimistöasetukset…";
"kOpenPrintPrefsKey"				= "Avaa tulostinasetukset…";
"kOpenSoundPrefsKey"				= "Avaa ääniasetukset…";
"kSendFileToDevice"					= "Lähetä tiedosto…";
"kBrowseDevice"						= "Selaa laitetta…";

"kTurnOnHeadphones"					= "Käytä äänilaitteena (stereo)";
"kTurnOffHeadphones"				= "Älä käytä äänilaitteena";
"kTurnOnHeadset"					= "Käytä äänilaitteena (mono)";
"kTurnOffHeadset"					= "Älä käytä äänilaitteena";

"kSyncDevice"						= "Synkronoi…";

"kOpenBTSAKey"						= "Asenna Bluetooth-laite…";
"kBTSendFileKey"					= "Lähetä tiedosto…";
"kBTGetFileKey"						= "Selaa laitetta…";

"kJoinNetwork"						= "Yhdistä verkkoon";
"kKeyDisconnectFromNetwork"			= "Katkaise yhteys";
"kRemoveDevice"						= "Poista laite";
"kDeviceOptions"					= "laiteasetukset";
"kDeviceNamed"						= "laite nimeltä %@";

"kOptionConfirm"					= "Haluatko varmasti poistaa tämän valintaneliön valinnan?";
"kOptionAutoBTSAWarning"			= "Varmista, että sinulla on USB-syöttölaite käytettävissä, jos langaton näppäimistö tai hiiri ei ole käytettävissä käynnistettäessä.";
	
